app/controllers/api/v1/users_controller.rb

      def create
        @user = User.create(username: user_params[:username], password: user_params[:password])
---
INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"